tutorials/Sun/constant/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          156;
        startFace       127164;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       127320;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       127440;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       127740;
    }
    backPlane
    {
        type            empty;
        inGroups        1(empty);
        nFaces          127584;
        startFace       128340;
    }
    frontPlane
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       255924;
    }
)

// ************************************************************************* //
