tutorials/Sun/constant/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * sediment properties * * * * * * * * * * * * //
phasea
{
    rho         rho [ 1 -3 0 0 0 ] 2500;
    nu          nu [ 0 2 -1 0 0 ] 1.2e-5;
    d           d [ 0 1 0 0 0 0 0 ] 2.25e-4;
    sF              sF   [ 0 0  0 0 0 0 0 ] 1.;    // shape Factor to adjust settling velocity for non-spherical particles
    hExp        hExp [ 0 0  0 0 0 0 0 ] 2.65; // hindrance exponent for drag: 
					      // beta^(-hExp) (2.65 by default)
}
// * * * * * * * * * * * * fluid properties * * * * * * * * * * * * //
phaseb
{
    rho         rho [ 1 -3 0 0 0 ] 1010;
    nu          nu [ 0 2 -1 0 0 ] 1.2e-05;
    d           d [ 0 1 0 0 0 0 0 ] 2.25e-4;
}
//*********************************************************************** //
transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 1e-6;

// Diffusivity for mass conservation resolution (avoid num instab around shocks)
alphaDiffusion  alphaDiffusion [0 2 -1 0 0 0 0] 1e-8; 

// viscosity limiter for the Frictional model (required for stability)
nuMax           nuMax [0 2 -1 0 0 0 0] 1e4;      

// minimum volume fraction (phase a) for division by alpha
alphaSmall      alphaSmall [ 0 0 0 0 0 0 0 ] 1e-6;  

// ************************************************************************* //
