tutorials/Sun/constant/granularRheologyProperties
/*
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      granaularRheologyProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

granularRheology   on;

granularDilatancy on;

granularCohesion off;
alphaMaxG       alphaMaxG [ 0 0 0 0 0 0 0 ] 0.655;

mus             mus  [ 0 0 0 0 0 0 0 ] 0.47;

mu2             mu2  [ 0 0 0 0 0 0 0 ] 0.81;

I0              I0  [ 0 0 0 0 0 0 0 ] 0.01;

Bphi            Bphi [ 0 0 0 0 0 0 0 ] 1.;

n               n [ 0 0 0 0 0 0 0 ] 2.5;

Dsmall          Dsmall [ 0 0 -1 0 0 0 0 ] 1e-6;

BulkFactor      BulkFactor [ 0 0 0 0 0 0 0 ] 0e0;

K_dila      K_dila [ 0 0 0 0 0 0 0 ] 2;

relaxPa         relaxPa [ 0 0 0 0 0 0 0 ] 1e-2;

// FrictionModel   Coulomb;
FrictionModel   MuIv;

// PPressureModel  none;
PPressureModel  MuIv;

FluidViscosityModel BoyerEtAl;

// ************************************************************************* //
