tutorials/Sun/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (granul water);

granul
{
    transportModel muIv;
    muIvCoeffs
    {
        mus        0.4;
        mud        0.72;
        I0         0.004;
        dg         0.8e-3;
        rhog       1011.0;
        nuMax      1e2;
        nuMin      1e-06;
        pMin       1.0;
       rmHydWaterP  true;
        rhoWater     1167.0;
	nuWater 2.49e-5;
       //rmHydAirP  true;
       // rhoAir     1.0;
       // nuAir 1e-05;

        alphaSmall 0.01;
    }
    // transportModel Newtonian;
    // nu           1;
    rho          1011.0;
}

water
{
    transportModel  Newtonian;
    nu              2.49e-5;
    rho             1167;
}

sigma            0.0;

// ************************************************************************* //



phasea
{
    rho         rho [ 1 -3 0 0 0 ] 2178;
    nu          nu [ 0 2 -1 0 0 ] 2.49e-5;
    d           d [ 0 1 0 0 0 0 0 ] 3.84e-3;
    sF              sF   [ 0 0  0 0 0 0 0 ] 1.;    // shape Factor to adjust settling velocity for non-spherical particles
    hExp        hExp [ 0 0  0 0 0 0 0 ] 2.65; // hindrance exponent for drag:
					      // beta^(-hExp) (2.65 by default)
    aE              aE   [ 0 0  0 0 0 0 0 ] 800;
    bE              bE   [ 0 0  0 0 0 0 0 ] 1.8;

}
// * * * * * * * * * * * * fluid properties * * * * * * * * * * * * //
phaseb
{
    rho         rho [ 1 -3 0 0 0 ] 1167;
    nu          nu [ 0 2 -1 0 0 ] 2.49e-5;
    d           d [ 0 1 0 0 0 0 0 ] 3.84e-3;
}
//*********************************************************************** //
transportModel  Newtonian;

    nu          nu [ 0 2 -1 0 0 ] 2.49e-5;

// Diffusivity for mass conservation resolution (avoid num instab around shocks)
alphaDiffusion  alphaDiffusion [0 2 -1 0 0 0 0] 1e-8;

// viscosity limiter for the Frictional model (required for stability)
nuMax           nuMax [0 2 -1 0 0 0 0] 10000;

// minimum volume fraction (phase a) for division by alpha
alphaSmall      alphaSmall [ 0 0 0 0 0 0 0 ] 1e-5;

// ************************************************************************* //
