tutorials/Sun/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;




vertices        
(
    (0 0     0.08) //0
    (0.4 0     0.08) //1
    (0.4 0.25  0.08) //2
    (0 0.25 0.08) //3
    (0 0    -0.0) //4
    (0.4 0    -0.0) //5
    (0.4 0.25 -0.0) //6
    (0 0.25 -0.0) //7
);
blocks          
(
    hex (0 1 5 4 3 2 6 7) (200 1 125) simpleGrading (1 1 1)

);

edges           
(
);






patches         
(
    patch inlet
    (
	(0 3 7 4)
    )
    patch outlet
    (
	(1 5 6 2)
    )
    wall top
    ((7 6 2 3)
    )
    wall bottom
    (
    (0 4 5 1)
    )
    empty backPlane
    (
	(0 1 2 3)
    )
    empty frontPlane
    (
    (4 7 6 5)
  //  (4 5 6 7)
    )
);


mergePatchPairs
(
);

// ************************************************************************* //
